{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0a283fe2a052eea87168db902280db0f18b0f5260d3a4662ac85935cfde1da84.json",
  "name": "Knowledge of Storage management at level 4",
  "description": "Knowledge of the planning, implementation, configuration and tuning of storage hardware and software covering online, offline, remote and offsite data storage (backup, archiving and recovery) and ensuring compliance with regulatory and security requirements.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/STMG_4_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/9a14bed222db6a0655b0db72f8b665bc1d9bf95a29c01aabe7c45f0e68dd2219",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Reviews capacity, performance, availability and other operational metrics and take appropriate action to ensure corrective and proactive maintenance of storage and backup systems to support the requirement to protect and secure business information. Creates reports and proposals for improvement and contributes to the planning and implementation of new installations and scheduled maintenance and changes within the system. Prepares and maintains operational procedures and provides technical expertise and appropriate information to the management."
  },
  "tags": [
    "knowledge",
    "level4"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/fae81777a595820f5699bb68c9be7cb9fd074376ac9f7171d6e4ec88871afdc4",
      "targetName": "Storage management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/service-management/service-operation/storage-management",
      "targetDescription": "The planning, implementation, configuration and tuning of storage hardware and software covering online, offline, remote and offsite data storage (backup, archiving and recovery) and ensuring compliance with regulatory and security requirements.",
      "targetCode": "STMG",
      "targetFramework": "SFIA version 7"
    }
  ]
}