{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0x2094ff46c8f39f5de5a7bc3b7e26f70f61b81f980d37c8f8c0405fdf686fe057.json",
  "name": "Proficiency in Marketing at level 6",
  "description": "Proficiency in the research, analysis and stimulation of potential or existing markets for IT and related products and services, both to provide a sound basis for business development and to generate a satisfactory flow of customer enquiries. The management and development of strategies, campaigns and day-to-day marketing activity delivered through appropriate channels",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/MKTG_6_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0xb989b5cf09ff76a89d6b1c1aac9b20c47f6c3aebf106f0b52f0635f915cd403c",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Determines and oversees the overall marketing strategy for the organisation to meet its business objectives. Provides oversight of all marketing plans and directs the marketing planning process. Evaluates and responds to key factors relating to the implementation, measurement and review of successful campaigns, including assessing the current and future capability needed by the marketing function, the role of staff engagement and business partners, and the appropriate mix of marketing activities and channels.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/7fcfd396e0e01ebb0e87c41ff1204fc07e9bf2cb9ebf1d695c6d376c48c5adc4",
      "targetName": "Marketing",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/client-interface/sales-and-marketing/marketing",
      "targetDescription": "The research, analysis and stimulation of potential or existing markets for IT and related products and services, both to provide a sound basis for business development and to generate a satisfactory flow of customer enquiries. The management and development of strategies, campaigns and day-to-day marketing activity delivered through appropriate channels",
      "targetCode": "MKTG",
      "targetFramework": "SFIA version 7"
    }
  ]
}