{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0x429871b9d836d8c267c8ada0220c4f35dbf152869910eb6ecead7fe0dca05322.json",
  "name": "Proficiency in Resourcing at level 5",
  "description": "Proficiency in the overall resource management of the workforce to enable effective operation of the organisation. Provision of advice on any aspect of acquiring resources, including employees, consultants and contractors.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/RESC_5_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0x4f1cf3e0002c440b9199fc8b28aedf3b6443fdefd7a0c2556a12f85835790376",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Develops plans to ensure that the organisation has appropriately skilled resources to meet organisational objectives and commitments. Manages the effective implementation of resource planning, recruitment, selection, assessment, on-boarding and transitioning of resources. Advises on standards, methods and tools for resource management. Ensures compliance with relevant statutory or external regulations and codes of good practice. Contributes to the development of resource management policies, standards and guidelines and to audits and assessment of resource management processes.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/5e5cffd70b4823a58bde0550213cf0790d8e582865e6c9935e9683c093fc356e",
      "targetName": "Resourcing",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/procurement-management-support/people-management/resourcing",
      "targetDescription": "The overall resource management of the workforce to enable effective operation of the organisation. Provision of advice on any aspect of acquiring resources, including employees, consultants and contractors.",
      "targetCode": "RESC",
      "targetFramework": "SFIA version 7"
    }
  ]
}