{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0x6f5dd80c5528a213ee23f6740f01a83dd4f81b797bf364dcb08d611121416ad5.json",
  "name": "Proficiency in Demand management at level 6",
  "description": "Proficiency in the analysis and proactive management of business demand for new services or modifications to existing service features or volumes. Collaborating with the business to prioritise demand in order to improve business value. Developing and communicating insights into patterns of demand. Proposing responses to meet both short-term and long-term demand and facilitating decision making and planning. Integrating demand analysis and planning with complementary strategic, operational and change planning processes.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/DEMM_6_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0x1a97a4df699f24cbb51e691a7adc3f4c9f8e6a2092417ba91ad757f8f3bd3990",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Defines the approach and sets policies for the discovery, analysis, planning, controlling and documentation of demand for services and products. Organises scoping and business priority setting for strategic business changes involving business policy-makers and direction setters. Engages with and influences senior stakeholders to improve the business value to be delivered from new or existing services and products. Leads the development of demand management capabilities and ensures decision making is informed by robust scenario planning and what-if analysis. Leads the integration of demand management with complementary strategic, operational and change management processes.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/5f2c6fce206b91c7ccfd44efb0a2d9d72d6e9dac3e9e895a75c374026b54bf97",
      "targetName": "Demand management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/business-strategy-and-planning/new-demand-management",
      "targetDescription": "The analysis and proactive management of business demand for new services or modifications to existing service features or volumes. Collaborating with the business to prioritise demand in order to improve business value. Developing and communicating insights into patterns of demand. Proposing responses to meet both short-term and long-term demand and facilitating decision making and planning. Integrating demand analysis and planning with complementary strategic, operational and change planning processes.",
      "targetCode": "DEMM",
      "targetFramework": "SFIA version 7"
    }
  ]
}