{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0x73d81f3da04118bf786ab3843030b3654c1c8c42339c9a047749156eca17897b.json",
  "name": "Proficiency in Marketing at level 3",
  "description": "Proficiency in the research, analysis and stimulation of potential or existing markets for IT and related products and services, both to provide a sound basis for business development and to generate a satisfactory flow of customer enquiries. The management and development of strategies, campaigns and day-to-day marketing activity delivered through appropriate channels",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/MKTG_3_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0xb437609b81317857cca821396b2d541d9724f5bf1ebe5ed37afc37f6ddefe6a7",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Leverages market research materials, customer and employee insights and other sources, to identify industry trends, needs and opportunities. Selects from and uses marketing tools appropriate to the allocated assignment. Conducts market research, and maintains relevant information, including lessons learned from previous campaigns, and effectiveness measures for current and previous activities. Contributes to marketing plans, identifying and articulating unique selling points and key messages for marketing material. Presents and communicates at marketing events.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level3"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/7fcfd396e0e01ebb0e87c41ff1204fc07e9bf2cb9ebf1d695c6d376c48c5adc4",
      "targetName": "Marketing",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/client-interface/sales-and-marketing/marketing",
      "targetDescription": "The research, analysis and stimulation of potential or existing markets for IT and related products and services, both to provide a sound basis for business development and to generate a satisfactory flow of customer enquiries. The management and development of strategies, campaigns and day-to-day marketing activity delivered through appropriate channels",
      "targetCode": "MKTG",
      "targetFramework": "SFIA version 7"
    }
  ]
}