{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0x85730f87b0c5bd736f7d9fd029e4113910ccddb1a3babe76f5e534fc202ebc2c.json",
  "name": "Proficiency in Data visualisation at level 5",
  "description": "Proficiency in the process of interpreting concepts, ideas, and facts by using graphical representations. Condensing and encapsulating the characteristics of data, making it easier to surface opportunities, identify risks, analyse trends, to drive effective decision-making. Presenting findings and data insights in creative ways to facilitate the understanding of data across a range of technical and non-technical audiences.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/VISL_5_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0x3402c051cea387048909a0433148129ed6079562a1c440eef16c5d3ae9c470d2",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Establishes the purpose and parameters of the data visualisation. Provides overall control, to ensure appropriate use of data visualisation tools and techniques. Formats and communicates results, using textual, numeric, graphical and other visualisation methods appropriate to the target audience. Advises on appropriate use of data visualisation for different purposes and contexts to enable requirements to be satisfied. Develops plans showing how the identified user needs will be met. Leads exploration of new approaches for data visualisation.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/442539f09a11fa25cc589172aa69d270a91de7b413aab08d4af3dde07dbaaf9e",
      "targetName": "Data visualisation",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/information-strategy/data-visualisation",
      "targetDescription": "The process of interpreting concepts, ideas, and facts by using graphical representations. Condensing and encapsulating the characteristics of data, making it easier to surface opportunities, identify risks, analyse trends, to drive effective decision-making. Presenting findings and data insights in creative ways to facilitate the understanding of data across a range of technical and non-technical audiences.",
      "targetCode": "VISL",
      "targetFramework": "SFIA version 7"
    }
  ]
}