{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0x9d10cf94b011db2d68f26914a655dd13cb37561025b586b9d4ba7d79333f0232.json",
  "name": "Proficiency in Real-time/embedded systems development at level 2",
  "description": "Proficiency in the architecture, design and development of reliable real time software, operating systems, tools and embedded systems. Embedding computer systems with a dedicated function within a larger mechanical or electronic system, often with real-time, safety, security, and reliability constraints. Typically includes interfacing with hardware, mechanical sensors and actuators for monitoring and control in applications such as industrial, automotive, aerospace and medical machinery, robots and equipment including IoT (Internet of Things) devices.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/RESD_2_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0xf860e2584cd0c0c5fdb712f33a4f29feb19fa6c44f3da082bd0643fe1acd59e4",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Designs the interactions between simple embedded systems components with hardware and the physical world, through sensors, actuators and I/O ports. Uses low level programming languages to develop simple real-time/embedded components as part of an overall systems design. Applies standard approaches to perform extensive testing of real-time/embedded systems, using specialised tools such as logic analysers, in-circuit emulators or digital storage oscilloscopes.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level2"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/c5953a3db16aa9282ddae34040a56cdefaf04ba5a4ee03cf2672b1cf16cdbb5d",
      "targetName": "Real-time/embedded systems development",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/solution-development-and-implementation/systems-development/new-real-time-embedded-systems-devlopment",
      "targetDescription": "The architecture, design and development of reliable real time software, operating systems, tools and embedded systems. Embedding computer systems with a dedicated function within a larger mechanical or electronic system, often with real-time, safety, security, and reliability constraints. Typically includes interfacing with hardware, mechanical sensors and actuators for monitoring and control in applications such as industrial, automotive, aerospace and medical machinery, robots and equipment including IoT (Internet of Things) devices.",
      "targetCode": "RESD",
      "targetFramework": "SFIA version 7"
    }
  ]
}