{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0xa3dadff2d911ba54e328c692fa493b1f1ab2bf0876ed2a6cc75ae070bfba0767.json",
  "name": "Proficiency in Testing at level 1",
  "description": "Proficiency in the planning, design, management, execution and reporting of tests, using appropriate testing tools and techniques and conforming to agreed process standards and industry specific regulations. The purpose of testing is to ensure that new and amended systems, configurations, packages, or services, together with any interfaces, perform as specified (including security requirements) , and that the risks associated with deployment are adequately understood and documented. Testing includes the process of engineering, using and maintaining testware (test cases, test scripts, test reports, test plans, etc) to measure and improve the quality of the software being tested.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/TEST_1_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0xf4d5833b12d2ff58b9279d31c0cdcd2f9476b36619d612caa0b5eca84c816973",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Executes given test scripts under supervision. Records results and reports issues. Develops an understanding of the role of testing within system development, as a tool for design improvement as well as a validation process.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level1"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/ccce9eba5b30761cae23880411f7394916e4822f0805de4d69703d0405b9b1bc",
      "targetName": "Testing",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/solution-development-and-implementation/systems-development/testing",
      "targetDescription": "The planning, design, management, execution and reporting of tests, using appropriate testing tools and techniques and conforming to agreed process standards and industry specific regulations. The purpose of testing is to ensure that new and amended systems, configurations, packages, or services, together with any interfaces, perform as specified (including security requirements) , and that the risks associated with deployment are adequately understood and documented. Testing includes the process of engineering, using and maintaining testware (test cases, test scripts, test reports, test plans, etc) to measure and improve the quality of the software being tested.",
      "targetCode": "TEST",
      "targetFramework": "SFIA version 7"
    }
  ]
}