{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0xf1c0d404c6852594a0b7745686b7e0f757d31acdd16c7765e851ac4e5b4454d3.json",
  "name": "Proficiency in Specialist advice at level 6",
  "description": "Proficiency in the development and exploitation of expertise in any specific area of information or communications technology, digital working, specific techniques, methodologies, products or application areas, for the purposes of providing specialist advice.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/TECH_6_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0x94bfde68ea0a40c1d5b3e009c02d185bc2cab187ac0cd17d2e42cbe331528973",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Provides organisational leadership and guidelines to promote the development and exploitation of specialist knowledge in the organisation. Maintains a network of recognised experts (inside and/or outside the organisation) who can deliver expert advice in areas relevant to the organisation's current and future needs. Provides input into professional development planning across a significant part of the organisation to further the development of appropriate expertise.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/54dfa838a0f9f157b2ae7b79237bee55d1c2eac59b34526952f5a4bfaf8b894a",
      "targetName": "Specialist advice",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/advice-and-guidance/technical-specialism",
      "targetDescription": "The development and exploitation of expertise in any specific area of information or communications technology, digital working, specific techniques, methodologies, products or application areas, for the purposes of providing specialist advice.",
      "targetCode": "TECH",
      "targetFramework": "SFIA version 7"
    }
  ]
}