{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/0xf64330b30be83b3c6c4c09a5c09a439061c727277bb60dd2a6b356c5dcf4a2fd.json",
  "name": "Proficiency in Benefits management at level 5",
  "description": "Proficiency in establishing an approach for forecasting, planning and monitoring the emergence and effective realisation of anticipated benefits. Identifying and implementing the actions needed to optimise the business impact of individual and combined benefits. The confirmation of the achievement of expected benefits.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/BENM_5_P.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/0x93a0e1aa69f0586b90acadd47678d9b326f2427f2e731e9712b3cca45ba23b62",
    "narrative": "The holder has applied relevant knowledge to demonstrate in a realistic (*) environment that they can perform most of the activities defined in the following SFIA description:  Identifies specific measures and mechanisms by which benefits can be measured, and plans to activate these mechanisms at the required time. Monitors benefits against what was predicted in the business case and ensures that all participants are informed and involved throughout the change programme and fully prepared to exploit the new operational business environment once it is in place. Supports operational managers to ensure that all plans, work packages and deliverables are aligned to the expected benefits and leads activities required in the realisation of the benefits of each part of the change programme.\n\n* Whilst proficiency must be demonstrated in a working context, a workplace supervisor may make a case to justify the use of a professional simulated environment for specific safety-critical tasks."
  },
  "tags": [
    "proficiency",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/88e0b3ca32a9e2a0736c53977bf09e68424126e7e04ead4fb78a39d665857c1a",
      "targetName": "Benefits management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/business-change/business-change-management/benefits-management",
      "targetDescription": "Establishing an approach for forecasting, planning and monitoring the emergence and effective realisation of anticipated benefits. Identifying and implementing the actions needed to optimise the business impact of individual and combined benefits. The confirmation of the achievement of expected benefits.",
      "targetCode": "BENM",
      "targetFramework": "SFIA version 7"
    }
  ]
}