{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/264f81eaf318dd9a8735f9559148ba791fd92ae0ef8eb1506f6f5d86afc97a03.json",
  "name": "Competence in Database design at level 5",
  "description": "Competence in the specification, design and maintenance of mechanisms for storage of and access to data in support of business information needs. Design of the physical data layer, addressing enterprise data resource needs and local stored data structures. Definition of physical or virtual data warehouse structures required to support business intelligence and data analytics services.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/DBDS_5_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/5b7a11a449c51de19044e7bf228866d769fcf889a641e381622ce420e4ab72b8",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Provides expert guidance in the selection, provision and use of database and data warehouse architectures, software and facilities. Provides specialist expertise in the design characteristics of database management systems (DBMS) or data warehouse products/services. Ensures that physical database design policy supports transactional data requirements for performance and availability. Ensures that data warehouse design policy supports demands for business intelligence and data analytics."
  },
  "tags": [
    "Competence",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/f4006797f79427fe4ec5af361983cf8b845a81233dd0412594b0d98f20f25395",
      "targetName": "Database design",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/solution-development-and-implementation/systems-development/database-repository-design",
      "targetDescription": "The specification, design and maintenance of mechanisms for storage of and access to data in support of business information needs. Design of the physical data layer, addressing enterprise data resource needs and local stored data structures. Definition of physical or virtual data warehouse structures required to support business intelligence and data analytics services.",
      "targetCode": "DBDS",
      "targetFramework": "SFIA version 7"
    }
  ]
}