{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/2edf573215d5d796b629eac709005a0c97395b12ac20b2b2513c057cdd7ee07f.json",
  "name": "Competence in Portfolio, programme and project support at level 6",
  "description": "Competence in the provision of support and guidance on portfolio, programme and project management processes, procedures, tools and techniques. Support includes definition of portfolios, programmes, and projects; advice on the development, production and maintenance of business cases; time, resource, cost and exception plans, and the use of related software tools. Tracking and reporting of programme/project progress and performance are also covered, as is the capability to facilitate all aspects of portfolio/ programme/ project meetings, workshops and documentation.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/PROF_6_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/164c9a98517f6951df6fd9b0bc16b84b0a43e2ff5447310a0d749aa02fb30f45",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Defines the approach/policy and sets standards for the support provided for managing and monitoring portfolios, programmes, and projects. This can also include: the governance/management of resources, directing and leading the implementation and on-going operation of an effective service organisation, ensuring delivery of effective services/resources in line with current and planned demand and reviewing the effective provision."
  },
  "tags": [
    "Competence",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/e68d3f5854896e7bd30c75bb507ba6647a77563111a24bee5a66f144ca1e6b45",
      "targetName": "Portfolio, programme and project support",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/business-change/business-change-implementation/portfolio-programme-and-project-support",
      "targetDescription": "The provision of support and guidance on portfolio, programme and project management processes, procedures, tools and techniques. Support includes definition of portfolios, programmes, and projects; advice on the development, production and maintenance of business cases; time, resource, cost and exception plans, and the use of related software tools. Tracking and reporting of programme/project progress and performance are also covered, as is the capability to facilitate all aspects of portfolio/ programme/ project meetings, workshops and documentation.",
      "targetCode": "PROF",
      "targetFramework": "SFIA version 7"
    }
  ]
}