{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/341747f82e2358ddfcac16892758fa7d9190f9d392883c8db57346f80a8d03d5.json",
  "name": "Competence in Safety engineering at level 3",
  "description": "Competence in the application of appropriate methods to assure safety during all lifecycle phases of safety-related systems developments, including maintenance and re-use. These include safety hazard and risk analysis, safety requirements specification, safety-related system architectural design, formal method design, safety validation and verification, and safety case preparation.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/SFEN_3_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/c4331971bd4c39b8d9ede1882bbbde518745e99022ae5a7cf56779c75b2e9227",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Assists with the collection of safety assurance evidence, undertaking all work in accordance with agreed safety, technical and quality standards, using appropriate methods and tools. Documents the results of hazard and risk analysis activities."
  },
  "tags": [
    "Competence",
    "level3"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/3678e7599c194704a403ae845f812ee20bb62325b469eaeb1a89ada5fbe9a898",
      "targetName": "Safety engineering",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/procurement-management-support/quality-and-conformance/safety-assessment",
      "targetDescription": "The application of appropriate methods to assure safety during all lifecycle phases of safety-related systems developments, including maintenance and re-use. These include safety hazard and risk analysis, safety requirements specification, safety-related system architectural design, formal method design, safety validation and verification, and safety case preparation.",
      "targetCode": "SFEN",
      "targetFramework": "SFIA version 7"
    }
  ]
}