{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/3e746c117ca67b962624b26e8f7a73c91b5de6bd9d0578c920a914b2e05692db.json",
  "name": "Knowledge of Change implementation planning and management at level 6",
  "description": "Knowledge of the definition and management of the process for deploying and integrating new digital capabilities into the business in a way that is sensitive to and fully compatible with business operations.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/CIPM_6_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/a36afd1d75fd5703f41eb71c460dbfacd271feb5b3e16e47d3400fdc343216d5",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Ensures that there is a business perspective on how any new technical capabilities will be integrated into the business, including planning around key business cycles, selecting appropriate customers for migration, etc. Initiates the business implementation plan, including all the activities that the business needs to do to prepare for new technical components and technologies. Ensures sites deliver site implementation plans that align with the overall plan. Tracks and reports against these activities to ensure progress. Defines and manages the activities to ensure achievement of the projected business benefits after delivery. Outlines key business engagement messages that need to be communicated throughout the programme/project."
  },
  "tags": [
    "knowledge",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/9b1516d0820aed19aec1a8e1bb478066a67a1de8eb92cd6a347f1dea2d5dfe0c",
      "targetName": "Change implementation planning and management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/business-change/business-change-management/change-implementation-planning-and-management",
      "targetDescription": "The definition and management of the process for deploying and integrating new digital capabilities into the business in a way that is sensitive to and fully compatible with business operations.",
      "targetCode": "CIPM",
      "targetFramework": "SFIA version 7"
    }
  ]
}