{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/427463842b9dfc20ae6888f5d5ed75046b7aea4a9adec23c5c1168545988ce15.json",
  "name": "Competence in Business process improvement at level 7",
  "description": "Competence in the creation of new and potentially disruptive approaches to performing business activities in order to create business opportunities; deliver new or improved products/services; or to improve supply chains. The identification and implementation of improvements to business operations, services and models. The assessment of the costs and potential benefits of the new approaches. The analysis and design of business processes in order to adopt and exploit technologies to improve business performance. The development of enterprise process management capabilities to increase organisational agility and responsiveness to change.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/BPRE_7_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/b5eeae46c1c0d14fc34f9008c01a8a616cc16954faccc93c4d9690c96d571d9a",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Directs the creation and review of a cross-functional, enterprise-wide approach and culture for embracing business process management and improvement. Drives the identification, evaluation and adoption of technologies to transform organisational agility; customer and user experience; improve supply chains and exploit business opportunities. Aligns business strategies, enterprise transformation and technology strategies. Ensures that the strategic application of business process change is embedded in the governance and leadership of the organisation."
  },
  "tags": [
    "Competence",
    "level7"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/f5a4b69fa8fb985d99424a27ce98b70cc0606f2cec3d8b0df1e1e77a79609fb1",
      "targetName": "Business process improvement",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/business-strategy-and-planning/business-process-improvement",
      "targetDescription": "The creation of new and potentially disruptive approaches to performing business activities in order to create business opportunities; deliver new or improved products/services; or to improve supply chains. The identification and implementation of improvements to business operations, services and models. The assessment of the costs and potential benefits of the new approaches. The analysis and design of business processes in order to adopt and exploit technologies to improve business performance. The development of enterprise process management capabilities to increase organisational agility and responsiveness to change.",
      "targetCode": "BPRE",
      "targetFramework": "SFIA version 7"
    }
  ]
}