{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/45a2f745e188ec53812e86f9ad09f7af5d3808212739f553ff61fe388936b796.json",
  "name": "Competence in Safety assessment at level 6",
  "description": "Competence in the assessment of safety-related software systems to determine compliance with standards and required levels of safety integrity. This involves making professional judgements on software engineering approaches, including the suitability of design, testing, and validation and verification methods, as well as the identification and evaluation of risks and the means by which they can be reduced. The establishment, maintenance and management of an assessment framework and practices.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/SFEN_6_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/21b7b819cb9f17cc6dbd8a0c5047ac97da9a7ee41d1f9f0489b5ce1654a247d5",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Leads assessments up to IEC 61508 Safety Integrity level 4 (or equivalent standard) or participates in any level of assessment. Determines assessment methods, techniques and tools that are to be used as appropriate to the integrity levels of the assessments undertaken."
  },
  "tags": [
    "Competence",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/3678e7599c194704a403ae845f812ee20bb62325b469eaeb1a89ada5fbe9a898",
      "targetName": "Safety engineering",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/procurement-management-support/quality-and-conformance/safety-assessment",
      "targetDescription": "The application of appropriate methods to assure safety during all lifecycle phases of safety-related systems developments, including maintenance and re-use. These include safety hazard and risk analysis, safety requirements specification, safety-related system architectural design, formal method design, safety validation and verification, and safety case preparation.",
      "targetCode": "SFEN",
      "targetFramework": "SFIA version 7"
    }
  ]
}