{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/4d59288da0158c9ca30017b3517a16a32ea853dc50388a02132f8fd621a92062.json",
  "name": "Knowledge of Quality assurance at level 5",
  "description": "Knowledge of the process of ensuring, through independent assessment and review, that appropriate working practices, quality control activities, organisational processes and quality standards are in place and adhered to and that best practices are promoted throughout the organisation. Quality assurance provides confidence to internal management and external bodies, such as customers or regulators, that quality requirements will be fulfilled. Quality assurance may relate to any area where quality standards are applied, including products, data, services and business processes.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/QUAS_5_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/754f0e237ed74f014d8d92ec3de5b21d60ab39a302a908cd278a8a045c464e9a",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Plans, organises and conducts formal independent audits of complex projects, major programmes or functional areas. Evaluates, appraises and identifies non-compliances with organisational standards, and determines whether appropriate quality control has been applied. Prepares and reports audit findings and determines the risks associated with those findings and ensures that corrective actions are carried out. Reviews and analyses audit reports to identify common areas of non-compliance and identifies opportunities to improve the effectiveness and efficiency of the organisational control mechanisms. Performs audits throughout the supply chain. Plans and oversees the assurance activities of others."
  },
  "tags": [
    "knowledge",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/7d6538001150cefe6c7a37660a696a8099751f494c5546473e35ba12276d92a2",
      "targetName": "Quality assurance",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/procurement-management-support/quality-and-conformance/quality-assurance",
      "targetDescription": "The process of ensuring, through independent assessment and review, that appropriate working practices, quality control activities, organisational processes and quality standards are in place and adhered to and that best practices are promoted throughout the organisation. Quality assurance provides confidence to internal management and external bodies, such as customers or regulators, that quality requirements will be fulfilled. Quality assurance may relate to any area where quality standards are applied, including products, data, services and business processes.",
      "targetCode": "QUAS",
      "targetFramework": "SFIA version 7"
    }
  ]
}