{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/56906173dfb9458aab8d5a4129dd0b2fdedf3bae8c4a397097495a2e592008ab.json",
  "name": "Knowledge of Systems installation/decommissioning at level 5",
  "description": "Knowledge of the installation, testing, implementation or decommissioning and removal of cabling, wiring, equipment, hardware and associated software, following plans and instructions and in accordance with agreed standards. The testing of hardware and software components, resolution of malfunctions, and recording of results. The reporting of details of hardware and software installed so that configuration management records can be updated.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/HSIN_5_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/38758d3f3a69eb67c4bd6c3da39dacc72f2b43950bfda7a0e28ae6eca73a06f3",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Takes responsibility for installation projects, providing effective team leadership, including information flow to and from the customer during project work. Develops and implements quality plans and method statements. Monitors the effectiveness of installations and ensures that appropriate recommendations for change are made."
  },
  "tags": [
    "knowledge",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/1eb5841dbf0d27f2b93e55fd6e352c6ba4de427a70853d783726d3f736f07359",
      "targetName": "Systems installation/decommissioning",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/solution-development-and-implementation/installation-and-integration/systems-installation-decommissioning",
      "targetDescription": "The installation, testing, implementation or decommissioning and removal of cabling, wiring, equipment, hardware and associated software, following plans and instructions and in accordance with agreed standards. The testing of hardware and software components, resolution of malfunctions, and recording of results. The reporting of details of hardware and software installed so that configuration management records can be updated.",
      "targetCode": "HSIN",
      "targetFramework": "SFIA version 7"
    }
  ]
}