{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/61fe9285528af6b2d8e190444afd619f691c5420a9677584e6b46480d9b5776d.json",
  "name": "Knowledge of Relationship management at level 7",
  "description": "Knowledge of the systematic identification, analysis, management, monitoring and improvement of stakeholder relationships in order to target and improve mutually beneficial outcomes. Gains commitment to action through consultation and consideration of impacts. Design the relationship management approach to be taken; including roles and responsibilities, governance, policies, processes, and tools, and support mechanisms. Creatively combines formal and informal communication channels in order to achieve the desired result.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/RLMT_7_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/079a28b55a5682b34ab783900eddb3d689595957038c64574b35c3aafd8c88bd",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Determines the strategic approach to understanding stakeholder objectives and requirements. Works with all interested parties to establish effective relationships between stakeholders, including responsibility for the relationship between technology functions and end users. Establishes and promotes the overall vision for how stakeholder objectives are met and determines organisational roles and alignment. Actively manages relationships with the most senior stakeholders, and is the ultimate escalation point for issue resolution. Defines, and gains agreement on, the principles for establishing effective relationships between stakeholders, including responsibility for the relationship between IT functions and end users."
  },
  "tags": [
    "knowledge",
    "level7"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/cfa64a25e8a30e9f3ded77c14adb99f9102538413e549b232b88ac20c7475556",
      "targetName": "Relationship management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/client-interface/relationship-management/stakeholder-relationship-management",
      "targetDescription": "The systematic identification, analysis, management, monitoring and improvement of stakeholder relationships in order to target and improve mutually beneficial outcomes. Gains commitment to action through consultation and consideration of impacts. Design the relationship management approach to be taken; including roles and responsibilities, governance, policies, processes, and tools, and support mechanisms. Creatively combines formal and informal communication channels in order to achieve the desired result.",
      "targetCode": "RLMT",
      "targetFramework": "SFIA version 7"
    }
  ]
}