{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/6325c5a656fab4fc211068e9fda018f009c17367e2785fbb20940488dc0d2523.json",
  "name": "Knowledge of Strategic planning at level 6",
  "description": "Knowledge of the creation, iteration and maintenance of a strategy in order to align organisational actions, plans and resources with business objectives and the development of plans to drive forward and execute that strategy. Working with stakeholders to communicate and embed strategic management via objectives, accountabilities and monitoring of progress.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/ITSP_6_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/f289ae32f9ddae96fb33ed5746f8222d540de927c48f64e0ace62a3b5f227554",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Sets policies, standards, and guidelines for how the organisation conducts strategy development and planning. Leads and manages the creation or review of a strategy which meets the requirements of the business. Develops, communicates, implements and reviews the processes which ensure that the strategic management is embedded in the management and operational plans of the organisation."
  },
  "tags": [
    "knowledge",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/9acf58e36e404d0885ad6562c3c42d786c37e373d66ee33ed1d8bc9bffd022e1",
      "targetName": "Strategic planning",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/information-strategy/it-strategy-and-planning",
      "targetDescription": "The creation, iteration and maintenance of a strategy in order to align organisational actions, plans and resources with business objectives and the development of plans to drive forward and execute that strategy. Working with stakeholders to communicate and embed strategic management via objectives, accountabilities and monitoring of progress.",
      "targetCode": "ITSP",
      "targetFramework": "SFIA version 7"
    }
  ]
}