{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/6b2837a0fb8b1d25a7e832be0aba69263a997317602b5bf2f9721d8532676f8a.json",
  "name": "Competence in Information content publishing at level 6",
  "description": "Competence in the evaluation and application of different publishing methods and options, recognising key features, including open source and proprietary options. The management and tuning of the processes that collect, assemble and publish information, including in unstructured and semi-structured forms, for delivery to the user. The management of copyright, data protection and other legal issues associated with publishing and re-use of published information and data.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/ICPM_6_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/6938128b836739a1a5dae57a3e81b533378c01d92a2677ca9ced40f9d28dc80f",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Develops the overall strategy for the delivery of information and knowledge, including preferred media, overall information structure, and rules for formatting content to meet the needs of the organisation and its desired audience(s). Ensures that adequate procedures, standards, tools and resources are in place to ensure the appropriate quality of material published by or on behalf of the organisation and it is in a form accessible to all potential users, including those with disabilities. Ensures that any legal issues related to publishing, including associate copyright concerns, are adequately managed."
  },
  "tags": [
    "Competence",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/b1ccdc9ef345c781a4ba2e9427ae87e7ed90de2cf3415a0daaa37812297c6b7c",
      "targetName": "Information content publishing",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/information-strategy/information-content-publishing",
      "targetDescription": "The evaluation and application of different publishing methods and options, recognising key features, including open source and proprietary options. The management and tuning of the processes that collect, assemble and publish information, including in unstructured and semi-structured forms, for delivery to the user. The management of copyright, data protection and other legal issues associated with publishing and re-use of published information and data.",
      "targetCode": "ICPM",
      "targetFramework": "SFIA version 7"
    }
  ]
}