{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/88ff6a6061b0af72608d1fed731fed90e38f866a2422b639e41b9d6182f8156b.json",
  "name": "Competence in User experience design at level 5",
  "description": "Competence in the process of iterative design to enhance user satisfaction by improving the usability and accessibility provided when interacting with a system, product or service. The design of users' digital and offline tasks, interactions and interfaces to meet usability and accessibility requirements. The refinement of designs in response to user-centred evaluation and feedback and communication of the design to those responsible for design, development and implementation.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/HCEV_5_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/8c0c1377077bcc57deacbe154620158eb68b130d51743695297f2959ce0802d6",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Determines the approaches to be used to design and prototype digital and off-line tasks, interactions and interfaces in line with the usability and accessibility requirements of the system, product or service. Uses iterative approaches to rapidly incorporate user feedback into designs. Plans and drives user experience design activities providing expert advice and guidance to support adoption of agreed approaches. Integrates required visual design and branding into the user experience design activities."
  },
  "tags": [
    "Competence",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/d458a62173629a059d39990a84008012105b15140a49391e10d1d96be4bc7e31",
      "targetName": "User experience design",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/solution-development-and-implementation/human-factors/ergonomic-design",
      "targetDescription": "The process of iterative design to enhance user satisfaction by improving the usability and accessibility provided when interacting with a system, product or service. The design of users' digital and offline tasks, interactions and interfaces to meet usability and accessibility requirements. The refinement of designs in response to user-centred evaluation and feedback and communication of the design to those responsible for design, development and implementation.",
      "targetCode": "HCEV",
      "targetFramework": "SFIA version 7"
    }
  ]
}