{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/8c0b19d3b7946d4bd272300187348b5b7b7d2de71dd09e7c3aeaaff6b1edd70b.json",
  "name": "Knowledge of Solution architecture at level 5",
  "description": "Knowledge of the design and communication of high-level structures to enable and guide the design and development of integrated solutions that meet current and future business needs. In addition to technology components, solution architecture encompasses changes to service, process, organisation, and operating models. The provision of comprehensive guidance on the development of, and modifications to, solution components to ensure that they take account of relevant architectures, strategies, policies, standards and practices (including security) and that existing and planned solution components remain compatible.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/ARCH_5_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/e11d86c0bdbd4e4a2e2a106a774342975f6f7f5741235ba4bb801d5ada8227da",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Leads the development of solution architectures in specific business, infrastructure or functional areas. Ensures that appropriate tools and methods are available, understood and employed in architecture development. Within a change programme, leads the preparation of technical plans and, in liaison with business assurance and project staff, ensures that appropriate technical resources are made available. Provides advice on technical aspects of solution development and integration (including requests for changes, deviations from specifications, etc.) and ensures that relevant technical strategies, policies, standards and practices (including security) are applied correctly."
  },
  "tags": [
    "knowledge",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/e2ae2985dd3a4b66e645ed5d2203d7fff33a4c02c75e87ebfd87503a17b888f5",
      "targetName": "Solution architecture",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/technical-strategy-and-planning/solution-architecture",
      "targetDescription": "The design and communication of high-level structures to enable and guide the design and development of integrated solutions that meet current and future business needs. In addition to technology components, solution architecture encompasses changes to service, process, organisation, and operating models. The provision of comprehensive guidance on the development of, and modifications to, solution components to ensure that they take account of relevant architectures, strategies, policies, standards and practices (including security) and that existing and planned solution components remain compatible.",
      "targetCode": "ARCH",
      "targetFramework": "SFIA version 7"
    }
  ]
}