{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/8ff312910006ab46b9f7f6a6c3c4b4d83f4df66cad07269a02724dfdc37ebcd8.json",
  "name": "Competence in Project management at level 7",
  "description": "Competence in the management of projects, typically (but not exclusively) involving the development and implementation of business processes to meet identified business needs, acquiring and utilising the necessary resources and skills, within agreed parameters of cost, timescales, and quality. The adoption and adaptation of project management methodologies based on the context of the project and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative/agile) approaches.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/PRMG_7_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/74d05447a2170f0a0206ae3b7e418a4811d171f9607b689e69b62c5c550cdc1d",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Sets organisational strategy governing the direction and conduct of project management, including application of appropriate methodologies. Authorises the management of large scale projects. Leads project planning, scheduling, controlling and reporting activities for strategic, high impact, high risk projects. Manages risk and ensures that solutions to problems are implemented in line with change control processes."
  },
  "tags": [
    "Competence",
    "level7"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/09f04e627dcaf727c137ee3b6dc9c8074f316687471870f16ca568c428d4b8bc",
      "targetName": "Project management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/business-change/business-change-implementation/project-management",
      "targetDescription": "The management of projects, typically (but not exclusively) involving the development and implementation of business processes to meet identified business needs, acquiring and utilising the necessary resources and skills, within agreed parameters of cost, timescales, and quality. The adoption and adaptation of project management methodologies based on the context of the project and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative/agile) approaches.",
      "targetCode": "PRMG",
      "targetFramework": "SFIA version 7"
    }
  ]
}