{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/960297876fb78a4f78775e544a4d173cd350e9b7215958ed06a2785d5c0fccde.json",
  "name": "Competence in Data management at level 6",
  "description": "Competence in the management of practices and processes to ensure the security, quality, integrity, safety and availability of all forms of data and data structures that make up the organisation's information. The management of data and information in all its forms and the analysis of information structure (including logical analysis of taxonomies, data and metadata). The development of innovative ways of managing the information assets of the organisation.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/DATM_6_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/44b0b2314aa07c164f34ddbf9e69d4bd92600f2876f6ca5dbc6de507725d5ecc",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Derives an overall strategy of master data management, within an established information architecture, that supports the development and secure operation of information and digital services. Develops organisational policies, standards, and guidelines for data management, aligned with ethical principles. Takes overall responsibility for planning effective data storage, security, quality, sharing, availability, retention and publishing within the organisation. Plans, establishes and manages processes for regular and consistent access to, and independent validation of external information from multiple sources."
  },
  "tags": [
    "Competence",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/9315937abf57b00eb6ea62218267b07fd8f58b47944ceb88ef567e4a0ede930e",
      "targetName": "Data management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/technical-strategy-and-planning/data-management",
      "targetDescription": "The management of practices and processes to ensure the security, quality, integrity, safety and availability of all forms of data and data structures that make up the organisation's information. The management of data and information in all its forms and the analysis of information structure (including logical analysis of taxonomies, data and metadata). The development of innovative ways of managing the information assets of the organisation.",
      "targetCode": "DATM",
      "targetFramework": "SFIA version 7"
    }
  ]
}