{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/aafb57075f0de5a471502fbb4d3af31fa8a99af82c16aab4e12396ecb88a9673.json",
  "name": "Competence in Supplier management at level 6",
  "description": "Competence in the alignment of an organisation's supplier performance objectives and activities with sourcing strategies and plans, balancing costs, efficiencies and service quality. The establishment of working relationships based on collaboration, trust, and open communication in order to encourage co-innovation and service improvement with suppliers. The proactive engagement of suppliers for mutual benefit to resolve operational incidents, problems, poor performance and other sources of conflict. The use of clear escalation paths for discussing and resolving issues. The management of performance and risks across multiple suppliers (internal and external) using a set of agreed metrics.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/SUPP_6_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/7664c8fab077f3a939ecc3d46782bcf62f0896d4d654c8de333fe14260128646",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Develops organisational policies, standards, and guidelines to ensure effective supplier management across the integrated supply chain. Defines the approach for commercial communications, and the management and maintenance of the relationship between the organisation and suppliers. Creates an environment in which the organisation and its suppliers collaborate to their mutual benefit, ensuring positive and effective working relationships are developed and maintained across the supply chain. Ensures that resources and tools are in place to conduct bench-marking. Reviews supplier analysis and assesses effectiveness across the supply chain. Assures that the quality of the services delivered by suppliers meet contractual commitments and business needs. Manages risks associated with information security, continuity and integrity of supply."
  },
  "tags": [
    "Competence",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/83bbdf6bca69ce7cc374825c425040da74a6942e3a2ca405bfa7c7bac2e14df3",
      "targetName": "Supplier management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/client-interface/relationship-management/new-supplier-management",
      "targetDescription": "The alignment of an organisation's supplier performance objectives and activities with sourcing strategies and plans, balancing costs, efficiencies and service quality. The establishment of working relationships based on collaboration, trust, and open communication in order to encourage co-innovation and service improvement with suppliers. The proactive engagement of suppliers for mutual benefit to resolve operational incidents, problems, poor performance and other sources of conflict. The use of clear escalation paths for discussing and resolving issues. The management of performance and risks across multiple suppliers (internal and external) using a set of agreed metrics.",
      "targetCode": "SUPP",
      "targetFramework": "SFIA version 7"
    }
  ]
}