{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/ad4c20c06393b0c12ede49e8a525c385de75b9cabb4a5e9d978a01219a96c719.json",
  "name": "Knowledge of Data visualisation at level 4",
  "description": "Knowledge of the process of interpreting concepts, ideas, and facts by using graphical representations. Condensing and encapsulating the characteristics of data, making it easier to surface opportunities, identify risks, analyse trends, to drive effective decision-making. Presenting findings and data insights in creative ways to facilitate the understanding of data across a range of technical and non-technical audiences.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/VISL_4_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/bfa00acf8266ae2615b149b1c74f7725f984e478e13d9a31d306f15a505955d1",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Applies a variety of visualisation techniques and designs the content and appearance of data visuals. Operationalises and automates activities for efficient and timely production of data visuals. Selects appropriate visualisation approach from a range of applicable options. Contributes to exploration and experimentation in data visualisation."
  },
  "tags": [
    "knowledge",
    "level4"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/442539f09a11fa25cc589172aa69d270a91de7b413aab08d4af3dde07dbaaf9e",
      "targetName": "Data visualisation",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/strategy-architecture/information-strategy/data-visualisation",
      "targetDescription": "The process of interpreting concepts, ideas, and facts by using graphical representations. Condensing and encapsulating the characteristics of data, making it easier to surface opportunities, identify risks, analyse trends, to drive effective decision-making. Presenting findings and data insights in creative ways to facilitate the understanding of data across a range of technical and non-technical audiences.",
      "targetCode": "VISL",
      "targetFramework": "SFIA version 7"
    }
  ]
}