{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/bb6c56db9e7eee6ad862b70994ae1f7457c33457836d71491ef428e15cc49d85.json",
  "name": "Competence in User experience evaluation at level 3",
  "description": "Competence in validation of systems, products or services, to assure that the stakeholder and organisational requirements have been met, required practice has been followed, and systems in use continue to meet organisational and user needs. Iterative assessment (from early prototypes to final live implementation) of effectiveness, efficiency, user satisfaction, health and safety, and accessibility to measure or improve the usability of new or existing processes, with the intention of achieving optimum levels of product or service usability.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/USEV_3_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/7b96c791618fddc88556d8cec4cc7a4607fd0a627a4e9e97e15e4696a649b666",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Evaluates design options and prototypes to obtain user feedback on requirements of developing systems, products or services. Tests the usability and accessibility of components and alternative designs. Administers a range of evaluations, recording data and feedback. Analyses evaluation data and recommend actions. Checks systems, products or services for adherence to applicable standards, guidelines, style guides, and legislation. Evaluates the usability of existing or competitor systems to provide benchmark values and as input to design."
  },
  "tags": [
    "Competence",
    "level3"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/2bf7669f204df4e118a92a3a74a54b757c9689cf0a9e37a209ae20507f92ac33",
      "targetName": "User experience evaluation",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/solution-development-and-implementation/human-factors/user-experience-evaluation",
      "targetDescription": "Validation of systems, products or services, to assure that the stakeholder and organisational requirements have been met, required practice has been followed, and systems in use continue to meet organisational and user needs. Iterative assessment (from early prototypes to final live implementation) of effectiveness, efficiency, user satisfaction, health and safety, and accessibility to measure or improve the usability of new or existing processes, with the intention of achieving optimum levels of product or service usability.",
      "targetCode": "USEV",
      "targetFramework": "SFIA version 7"
    }
  ]
}