{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/c1b6fc693ff502d61bfce31f79eecb97a7b7219489d270d6f2455e1161babfeb.json",
  "name": "Competence in Sourcing at level 7",
  "description": "Competence in the provision of policy, internal standards and advice on the procurement or commissioning of externally supplied and internally developed products and services. The provision of commercial governance, conformance to legislation and assurance of information security. The implementation of compliant procurement processes, taking full account of the issues and imperatives of both the commissioning and supplier sides. The identification and management of suppliers to ensure successful delivery of products and services required by the business.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/SORC_7_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/e55afc4049fd825a77e83e66f012954d99dd5d32407fad0b70ffa64eaeaad7b2",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Takes overall responsibility for conformance to legislation; supply chain management; commercial governance; policy and procedures for selection of suppliers, tendering and procurement (including \"\"build or buy\"\" criteria, and benchmarking performance). Determines overall strategies for managing supplier relationships, embracing effective operational relationships at all levels. Is responsible for deployment and review of acquisition processes and for negotiating major contracts."
  },
  "tags": [
    "Competence",
    "level7"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/19d49456848d018f999f0d3a05cc9f99cad2a01e59614bc90301b0f0688e8985",
      "targetName": "Sourcing",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/client-interface/relationship-management/sourcing",
      "targetDescription": "The provision of policy, internal standards and advice on the procurement or commissioning of externally supplied and internally developed products and services. The provision of commercial governance, conformance to legislation and assurance of information security. The implementation of compliant procurement processes, taking full account of the issues and imperatives of both the commissioning and supplier sides. The identification and management of suppliers to ensure successful delivery of products and services required by the business.",
      "targetCode": "SORC",
      "targetFramework": "SFIA version 7"
    }
  ]
}