{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/e7b30f0776d539622f6bef7aab6d08230c475612cb9c20300d87145da5510c0f.json",
  "name": "Competence in Selling at level 5",
  "description": "Competence in the identification of sales prospects and their qualification, the development of customer interest and the preparation (including managing the bid process), execution and monitoring of the sale of any product or service into an external or internal market.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/SALE_5_C.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/467d6daf000864912f940d44c5e4d5f0a4e49cf6cf09b1e3579e51cc2c1b7951",
    "narrative": "The holder has demonstrated, in a working environment, that they have consistently and reliably achieved the expected outcomes at a professional level for the following SFIA description: Designs and implements sales strategies and works with senior management to implement sales plans. Plans, monitors and controls the work of sales teams. Develops and maintains effective customer relationships at executive levels and qualifies new sales leads. Leads the bid process within the organisation. Agrees and signs contracts. Maintains customer contact during and after the selling process to pre-empt any issues and identify further opportunities. Contributes to the development and training of sales teams and product/service development."
  },
  "tags": [
    "Competence",
    "level5"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/6eeb2a362356192d37c189bc44fb7519df766bf50ddabbab7e2358d605214370",
      "targetName": "Selling",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/client-interface/sales-and-marketing/selling",
      "targetDescription": "The identification of sales prospects and their qualification, the development of customer interest and the preparation (including managing the bid process), execution and monitoring of the sale of any product or service into an external or internal market.",
      "targetCode": "SALE",
      "targetFramework": "SFIA version 7"
    }
  ]
}