{
  "@context": "https://w3id.org/openbadges/v2",
  "type": "BadgeClass",
  "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/badges/f1ab612a46d5593c6c01022c3299ad563b23e6dac4a929797fa5056a4f8c60fd.json",
  "name": "Knowledge of Facilities management at level 6",
  "description": "Knowledge of the planning, control and management of all the facilities which, collectively, make up the IT estate. This involves provision and management of the physical environment, including space and power allocation, and environmental monitoring to provide statistics on energy usage. Encompasses physical access control, and adherence to all mandatory policies and regulations concerning health and safety at work.",
  "image": "http://ioc-dev.kmi.open.ac.uk/images/badges/DCMA_6_K.png",
  "issuer": {
    "type": "Issuer",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/issuers/2bd1895a4223ce1d243130bb7e21b23ebd2f218448116048a138aacb2ebb7829.json",
    "name": "Institute of Coding",
    "description": "Our mission is to break down barriers to digital learning and employment. We believe learning should be a lifelong process and that everyone has a right to improve their skills. We want to spread opportunity by offering access to education, providing what you need, when you need it, in a place you can reach.",
    "url": "https://instituteofcoding.org/",
    "email": "ioc@bath.ac.uk",
    "image": "https://ioc.kmi.open.ac.uk/images/ioc-logo.png"
  },
  "criteria": {
    "type": "Criteria",
    "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/criteria/da8cc6a6322135f9136d010a847dd1d68081cacda73944aca3acdab72c1efb89",
    "narrative": "The holder has demonstrated that they can explain and discuss the knowledge relevant to the following SFIA description: Sets the organisational policy for the management of the IT estate and ensures that policy is reflected using best practice. Develops strategies to ensure future requirements for data centre space can be forecast and fulfilled. Takes overall responsibility for adherence to health & safety regulations and electrical safety policy. Seeks out and ensures use of industry best practice to ensure future plans are aligned to meet corporate sustainability targets."
  },
  "tags": [
    "knowledge",
    "level6"
  ],
  "alignment": [
    {
      "@context": "https://w3id.org/openbadges/v2",
      "type": "AlignmentObject",
      "id": "https://kmiopenblockchain.github.io/ioc-badging-skills/alignments/c93871822684ce65a200fca7591b499a1f74107c35d8f15e7d2e680dd73cfbef",
      "targetName": "Facilities management",
      "targetUrl": "https://www.sfia-online.org/en/framework/sfia-7/skills/service-management/service-operation/it-estate-management",
      "targetDescription": "The planning, control and management of all the facilities which, collectively, make up the IT estate. This involves provision and management of the physical environment, including space and power allocation, and environmental monitoring to provide statistics on energy usage. Encompasses physical access control, and adherence to all mandatory policies and regulations concerning health and safety at work.",
      "targetCode": "DCMA",
      "targetFramework": "SFIA version 7"
    }
  ]
}